app/controllers/homes_controller.rb

SELECT  "tasks".* FROM "tasks" ORDER BY "tasks"."created_at" DESC LIMIT $1  [["LIMIT", 12]]
---
  def top
    @new_tasks = Task.order(created_at: :desc).limit(12)