app/controllers/home_controller.rb

  def top
    @new_tasks = Task.order(created_at: :desc).limit(4)
    @update_tasks = Task.order(updated_at: :desc).limit(4)
---
SELECT  "tasks".* FROM "tasks" ORDER BY "tasks"."created_at" DESC LIMIT $1  [["LIMIT", 4]]
SELECT  "tasks".* FROM "tasks" ORDER BY "tasks"."updated_at" DESC LIMIT $1  [["LIMIT", 4]]