app/controllers/tasks_controller.rb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "やっほ\r\n"], ["updated_at", "2019-10-07 16:50:56.632028"], ["id", 2]]
---
    task = Task.find(params[:id])
    task.update!(task_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 1]]
---
    task = Task.find(params[:id])
    task.destroy

INSERT INTO "tasks" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "幕府を建てる"], ["description", "平氏討伐"], ["created_at", "2019-11-08 16:46:35.344193"], ["updated_at", "2019-11-08 16:46:35.344193"]]
---
  def create
  @task = Task.new(task_params)

  if params[:image]
  @task.image_name = "#{@task.id}.jpg"
  image = params[:image]
  File.binwrite("public/user_images/#{@task.image_name}", image.read)
  end

  if @task.save